Revit 2027 API
BuiltInFailures.AssemblyFailures.MixedPhasesInAssembly Property
 Assembly cannot be created. All elements must have the same phases to be included in an assembly.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId MixedPhasesInAssembly { get; }
Public Shared ReadOnly Property MixedPhasesInAssembly As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ MixedPhasesInAssembly {
	FailureDefinitionId^ get ();
}
static member MixedPhasesInAssembly : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AssemblyFailures Class
Autodesk.Revit.DB Namespace